In [1]:
import pandas as pd

In [2]:
dict1 = {'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv','Mittal','Archana'], 
         'Marks':[98,89,99,87,90,83,99], 
         'Gender':['Male','Female','Female','Male','Male','Female','Female']}

In [3]:
df = pd.DataFrame(dict1, index= ['a','b','c','d','e','f','g'])

In [4]:
df

      Name  Marks  Gender
a  Priyang     98    Male
b   Aadhya     89  Female
c   Krisha     99  Female
d   Vedant     87    Male
e   Parshv     90    Male
f   Mittal     83  Female
g  Archana     99  Female

In [5]:
# DISPLAY TOP 3 ROWS
df.head(3)

      Name  Marks  Gender
a  Priyang     98    Male
b   Aadhya     89  Female
c   Krisha     99  Female

In [6]:
# DISPLAY LAST 3 ROWS
df.tail(3)

      Name  Marks  Gender
e   Parshv     90    Male
f   Mittal     83  Female
g  Archana     99  Female

In [7]:
# FIND SHAPE OF OUR DATASET
df.shape

(7, 3)

In [8]:
# GET OVERALL INFOMATION 
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, a to g
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [9]:
# CHECKING FOR NULL VALUES 
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
# GETTING OVERALL STATISTICS 
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [11]:
# CHECKING FOR UNIQUE VALUES
df['Gender'].unique() # REMEMBER NOT TO USE GROUPBY cause "group by" doesnt have the .unique method

array(['Male', 'Female'], dtype=object)

In [40]:
# CHECKING THE NUMBER OF UNIQUE VALUES 
df['Gender'].nunique()

2

In [13]:
# counting the unique values
df['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [14]:
# (1)CONDITIONAL SELECTION 
df[df['Marks']>=90]

      Name  Marks  Gender
a  Priyang     98    Male
c   Krisha     99  Female
e   Parshv     90    Male
g  Archana     99  Female

In [15]:
## (2) CONDITIONAL SELECTION 
df[(df['Marks']>=90) & (df['Marks']<=100)]

      Name  Marks  Gender
a  Priyang     98    Male
c   Krisha     99  Female
e   Parshv     90    Male
g  Archana     99  Female

In [16]:
# (3) CONDITIONAL SELECTION - BUT USING THE .BETWEEN METHOD 
df[df['Marks'].between(90,100)]

      Name  Marks  Gender
a  Priyang     98    Male
c   Krisha     99  Female
e   Parshv     90    Male
g  Archana     99  Female

In [17]:
# A FORM OF CONDITIONAL SELECTION 
sum(df['Marks'].between(90,100))

4

In [18]:
# counting the unique values
df.groupby('Gender').count()['Marks']

Gender
Female    4
Male      3
Name: Marks, dtype: int64

In [19]:
# FINDING THE THE AVERAGE VALUE OF MEAN
df['Marks'].mean()

92.14285714285714

In [20]:
# FINDING THE MINIMUM VALUE OF MARK
df['Marks'].min()

83

In [21]:
# FINDING MAX VALUE OF MAX
df['Marks'].max()

99

In [22]:
## APPLY -  USED TO APPL A FUNCTION IN FORM OF A LOOP ALL THROUGH A COLUMN AND CAN BE USED FOR MULTIPLE COLUMNS 
# MAP - ALSO USED TO APPLY A FUNCTION IN FORM OF A LOOP THROUGH A COLUMN BUT ITS USED FOR ONLY ONE COLUMN 
# A MAP ALSO CAN BE USED TO SUBSTITUTE EACH VALUE IN A SERIES WITH ANOTER VALUE
# A MAP CAN DO THE WORK OF APPLY BUT APPL CANT DO THE SUBSTITUITION JOB THAT MAP CAN DO

In [23]:
#netflix['nonsensical_column'] = netflix.apply(lambda x: len(x['cast'].split(',')) + len(x['listed_in'].split(',')), axis = 1)

In [24]:
df['Marks'].map(lambda x: x/2)

a    49.0
b    44.5
c    49.5
d    43.5
e    45.0
f    41.5
g    49.5
Name: Marks, dtype: float64

In [25]:
df['Marks'].apply(lambda x: x/2)

a    49.0
b    44.5
c    49.5
d    43.5
e    45.0
f    41.5
g    49.5
Name: Marks, dtype: float64

In [26]:
df['Gender'].map({'Male':1, 'Female':0})

a    1
b    0
c    0
d    1
e    1
f    0
g    0
Name: Gender, dtype: int64

In [27]:
df['Name'].apply(len)

a    7
b    6
c    6
d    6
e    6
f    6
g    7
Name: Name, dtype: int64

In [28]:
df['Name'].map(len)

a    7
b    6
c    6
d    6
e    6
f    6
g    7
Name: Name, dtype: int64

In [29]:
df1 = df.copy()

In [30]:
df1['Mark2'] = df['Marks'].map(lambda x: x*3)

In [38]:
df1['Mark3'] = df1.apply(lambda x: (x['Marks']/2) + " " + (x['Mark2']/2), axis=1)

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [35]:
df1

      Name  Marks  Gender  Mark2  Mark3
a  Priyang     98    Male    294  196.0
b   Aadhya     89  Female    267  178.0
c   Krisha     99  Female    297  198.0
d   Vedant     87    Male    261  174.0
e   Parshv     90    Male    270  180.0
f   Mittal     83  Female    249  166.0
g  Archana     99  Female    297  198.0